TestPlans/Car/Debenhams/xml/DCI3_21112014_5.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="www.openecommerce.co.uk">
  <soap:Body>
    <ns1:getQuote>
      <requestXML>&lt;Request&gt;
  &lt;Product&gt;Motor&lt;/Product&gt;
  &lt;AggregatorID&gt;CTM1708&lt;/AggregatorID&gt;
  &lt;Quote Id="1"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="2"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="3"&gt;
    &lt;BrokerReference&gt;ELD19010&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="4"&gt;
    &lt;BrokerReference&gt;DSI0012606&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="5"&gt;
    &lt;BrokerReference&gt;KWR0104&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="6"&gt;
    &lt;BrokerReference&gt;PRC2407&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="7"&gt;
    &lt;BrokerReference&gt;INC807&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="8"&gt;
    &lt;BrokerReference&gt;EDB0311&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
&lt;/Request&gt;</requestXML>
      <riskXML>&lt;Risk&gt;
  &lt;Policy&gt;
    &lt;CoverDate&gt;23/11/2014&lt;/CoverDate&gt;
    &lt;InsCancelled abiCode="N" /&gt;
    &lt;InsRefused abiCode="N" /&gt;
    &lt;ImposedTerms abiCode="N" /&gt;
    &lt;PrevPayment&gt;A&lt;/PrevPayment&gt;
    &lt;VolExcess&gt;600&lt;/VolExcess&gt;
    &lt;TotalVehiclesInHousehold&gt;8&lt;/TotalVehiclesInHousehold&gt;
  &lt;/Policy&gt;
  &lt;Person&gt;
    &lt;ContactEmail&gt;transformerPC05@emailreaction.org&lt;/ContactEmail&gt;
    &lt;ContactTelephone&gt;01733320301&lt;/ContactTelephone&gt;
    &lt;ContactAlternatePhone&gt;01733320301&lt;/ContactAlternatePhone&gt;
    &lt;Address1&gt;174 Partington Lane&lt;/Address1&gt;
    &lt;Address2&gt;Swinton&lt;/Address2&gt;
    &lt;Address3&gt;Manchester&lt;/Address3&gt;
    &lt;Address4 /&gt;
    &lt;PostCode&gt;M27 0WN&lt;/PostCode&gt;
    &lt;AnothersBus abiCode="N" /&gt;
    &lt;Commuting abiCode="Y" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="Y" /&gt;
    &lt;PersonalBus abiCode="Y" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="N" /&gt;
    &lt;OtherOwnVehType /&gt;
    &lt;OtherCompanyVehInd abiCode="Y" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="Y" /&gt;
    &lt;OtherCompanyVehSoleUse abiCode="N" /&gt;
    &lt;DateMovedToUK&gt;1977-05-05&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;05/05/1977&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="M" /&gt;
    &lt;FirstName&gt;Edward&lt;/FirstName&gt;
    &lt;Gender abiCode="M" /&gt;
    &lt;HasNonMotorConv abiCode="Y" /&gt;
    &lt;HomeOwner abiCode="Y" /&gt;
    &lt;LicHeld&gt;4&lt;/LicHeld&gt;
    &lt;LicType abiCode="P" /&gt;
    &lt;LicUnit&gt;Y&lt;/LicUnit&gt;
    &lt;MaritalStatus abiCode="M" /&gt;
    &lt;OtherCompanyVehYears&gt;1&lt;/OtherCompanyVehYears&gt;
    &lt;Surname&gt;Five&lt;/Surname&gt;
    &lt;Title&gt;Dr&lt;/Title&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;0&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;P&lt;/AtFault&gt;
      &lt;IncidentType&gt;HtR&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="Y" /&gt;
      &lt;ClaimDate&gt;01/01/2012&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;3000.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="A" /&gt;
      &lt;NCBAff&gt;Y&lt;/NCBAff&gt;
      &lt;Date&gt;01/01/2012&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="323" /&gt;
      &lt;EmpStat abiCode="E" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="653" /&gt;
    &lt;/Occupation&gt;
    &lt;PrivateMileage&gt;2000&lt;/PrivateMileage&gt;
    &lt;BusinessMileage&gt;5000&lt;/BusinessMileage&gt;
  &lt;/Person&gt;
  &lt;Person&gt;
    &lt;AnothersBus abiCode="N" /&gt;
    &lt;Commuting abiCode="Y" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="Y" /&gt;
    &lt;PersonalBus abiCode="Y" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="Y" /&gt;
    &lt;OtherOwnVehType&gt;PC&lt;/OtherOwnVehType&gt;
    &lt;OtherCompanyVehInd abiCode="N" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="Y" /&gt;
    &lt;OtherOwnVehNCB abiCode="0" /&gt;
    &lt;DateMovedToUK&gt;1976-06-04&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;04/06/1976&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="F" /&gt;
    &lt;FirstName&gt;Adam&lt;/FirstName&gt;
    &lt;Gender abiCode="M" /&gt;
    &lt;HasNonMotorConv abiCode="N" /&gt;
    &lt;LicHeld&gt;20&lt;/LicHeld&gt;
    &lt;LicType abiCode="F" /&gt;
    &lt;LicUnit&gt;Y&lt;/LicUnit&gt;
    &lt;MaritalStatus abiCode="M" /&gt;
    &lt;Surname&gt;One&lt;/Surname&gt;
    &lt;Title&gt;Mr&lt;/Title&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;0&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;Y&lt;/AtFault&gt;
      &lt;IncidentType&gt;NoV&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="N" /&gt;
      &lt;ClaimDate&gt;01/08/2011&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;0.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="T" /&gt;
      &lt;NCBAff&gt;Y&lt;/NCBAff&gt;
      &lt;Date&gt;01/08/2011&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="726" /&gt;
      &lt;EmpStat abiCode="E" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="03A" /&gt;
    &lt;/Occupation&gt;
    &lt;RelationshipToProp abiCode="S" /&gt;
  &lt;/Person&gt;
  &lt;Person&gt;
    &lt;AnothersBus abiCode="N" /&gt;
    &lt;Commuting abiCode="N" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="N" /&gt;
    &lt;PersonalBus abiCode="N" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="N" /&gt;
    &lt;OtherOwnVehType /&gt;
    &lt;OtherCompanyVehInd abiCode="N" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="N" /&gt;
    &lt;DateMovedToUK&gt;1980-10-08&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;08/10/1980&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="F" /&gt;
    &lt;FirstName&gt;Esme&lt;/FirstName&gt;
    &lt;Gender abiCode="F" /&gt;
    &lt;HasNonMotorConv abiCode="N" /&gt;
    &lt;LicHeld&gt;7&lt;/LicHeld&gt;
    &lt;LicType abiCode="E" /&gt;
    &lt;LicUnit&gt;Y&lt;/LicUnit&gt;
    &lt;MaritalStatus abiCode="D" /&gt;
    &lt;Surname&gt;Five&lt;/Surname&gt;
    &lt;Title&gt;Miss&lt;/Title&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;0&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;Y&lt;/AtFault&gt;
      &lt;IncidentType&gt;NoV&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="N" /&gt;
      &lt;ClaimDate&gt;01/12/2011&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;0.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="F" /&gt;
      &lt;NCBAff&gt;Y&lt;/NCBAff&gt;
      &lt;Date&gt;01/12/2011&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="186" /&gt;
      &lt;EmpStat abiCode="R" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="R09" /&gt;
    &lt;/Occupation&gt;
    &lt;RelationshipToProp abiCode="M" /&gt;
  &lt;/Person&gt;
  &lt;Vehicle&gt;
    &lt;ABICode&gt;52011702&lt;/ABICode&gt;
    &lt;ImmobSecurityMake&gt;UT1&lt;/ImmobSecurityMake&gt;
    &lt;ImmobSecurityFitted&gt;Unknown&lt;/ImmobSecurityFitted&gt;
    &lt;CoverType abiCode="01" /&gt;
    &lt;EstimatedValue&gt;2345&lt;/EstimatedValue&gt;
    &lt;Keeper abiCode="2" /&gt;
    &lt;Lhd&gt;N&lt;/Lhd&gt;
    &lt;Modified abiCode="N" /&gt;
    &lt;NCBType&gt;PC&lt;/NCBType&gt;
    &lt;NCBProtected&gt;N&lt;/NCBProtected&gt;
    &lt;NCBYears&gt;1&lt;/NCBYears&gt;
    &lt;NightLocation abiCode="3" /&gt;
    &lt;Owner abiCode="2" /&gt;
    &lt;OvernightPostCode&gt;M27 0WN&lt;/OvernightPostCode&gt;
    &lt;PurchaseDate&gt;01/10/2007&lt;/PurchaseDate&gt;
    &lt;Registration&gt;X779NBM&lt;/Registration&gt;
    &lt;YearManufacture&gt;2000&lt;/YearManufacture&gt;
    &lt;Seats&gt;5&lt;/Seats&gt;
  &lt;/Vehicle&gt;
&lt;/Risk&gt;</riskXML>
    </ns1:getQuote>
  </soap:Body>
</soap:Envelope>